# Используйте официальный образ Node.js в качестве базового образа
FROM node:16-alpine3.11

# Установите рабочий каталог в контейнере
WORKDIR /usr/src/app

# Установите bash и другие зависимости
RUN apk --no-cache add bash

# Копируйте только файлы, связанные с зависимостями, и устанавливайте их отдельно,
# чтобы использовать кэш npm install, если package.json не изменился
COPY package*.json ./

# Установите зависимости
RUN npm install

# Копируйте остальные файлы приложения
COPY . .

# Копируйте файл конфигурации TypeORM из директории src
COPY ./src/ormconfig.ts .

# Дождитесь готовности базы данных и запустите приложение
CMD ["npm", "run", "start:dev"]
